* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
DEFINE DATA LOCAL
    1 VISTA-DEPARTAMENTO VIEW OF DEPARTAMENTOS
        2 COD-DEPT
        2 DESC
END-DEFINE
*
READ VISTA-DEPARTAMENTO BY VISTA-DEPARTAMENTO.COD-DEPT
  DISPLAY COD-DEPT DESC
*
END-READ
*
END