* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
DEFINE DATA LOCAL
1 VISTA-EMPLEADO VIEW OF EMPLOYEES
    2 ID-EMPLEADO
END-DEFINE
*
FD. FIND VISTA-EMPLEADO WITH VISTA-EMPLEADO.ID-EMPLEADO = '99300508'
         DELETE (FD.)
         END TRANSACTION
         WRITE 'EL REGISTRO FUE ELIMINADO'
     END-FIND
     WRITE 'YA SE ELIMINO'
*
END