* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
DEFINE DATA LOCAL
  1 VISTA-EMP VIEW OF EMPLOYEES
    2 ID-EMPLEADO                  
    2 NOMBRE                  
    2 APELLIDO 
    2 PROFESION
*
END-DEFINE
*
*
READ VISTA-EMP BY VISTA-EMP.ID-EMPLEADO = '99300708'
  DISPLAY 'ID EMPLEADO' VISTA-EMP.ID-EMPLEADO
          'NOMBRE'     VISTA-EMP.NOMBRE
          'APELLIDO'   VISTA-EMP.APELLIDO
          'PROFESION'  VISTA-EMP.PROFESION
*
END-READ
*
END
