* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
DEFINE DATA LOCAL
  1 VISTA-MONEDA VIEW OF MONEDAS
    2 COD-MONEDA
    2 DESC
*
  1 #COD-MONEDA (A03)
  1 #DESC       (A20)
END-DEFINE
*
*
READ VISTA-MONEDA BY VISTA-MONEDA.COD-MONEDA
  DISPLAY COD-MONEDA DESC
*
END-READ
*
END