* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
DEFINE DATA LOCAL
1 VISTA-EMP VIEW OF EMPLOYEES
  2 DEPARTAMENTO
END-DEFINE
*
H1. HISTOGRAM VISTA-EMP DEPARTAMENTO 
         DISPLAY VISTA-EMP.DEPARTAMENTO
                 *NUMBER(H1.)
END-HISTOGRAM
*
END